# ДЗ: Операции, Типы, Сравнение, Условия и Логические операторы.

## Материал занятия

Ответьте на все контрольные (и теоретические) вопросы в 
[материале лекции](/javascript-types-expression-conditions-logic)

## assign: evaluation

Исследуйте код, найдите выражения в нём. Расставьте скобки так, что бы код не изменил своего поведения (работал так же как и сейчас). Объясните как и в каком порядке вычисляются выражения и подвыражения.

```javascript
var a = 5;  //выражение
var b, c;

b = (a * 5);  //выражение
b = (c = b/2);  //выражение
```

## semicolon: error

Сделайте несколько примеров кода, отсутствие `;` в которых приводит к синтаксической ошибке
var a var b

return
a


## semicolon: mistake

Сделайте несколько примеров кода, наличиe или отсутствие `;` в которых приводит к **логической** ошибке (т. е. код выполняется без синтаксических ошибок, но делает не то, что задумано)

alert("Сейчас будет ошибка")  //должна быть точка с запятой
[1, 2].forEach(alert)

a = b + c 
(d + e).print() 

## Number: age

С помощью `prompt` спросить у пользователя его возраст и подсчитать год рождения. Год рождения вывести с помощью `alert`.

var yourAge = +prompt("Ваш возраст");
var curentDate = new Date();
var date = curentDate.getFullYear();
var year = date- yourAge;
alert(year);


## Number: temperature

С помощью `prompt` спросить у пользователя температуру в градусах Цельсия и перевести их в Фаренгейты и/или наоборот. 

var farenheit = +prompt("Сколько градусов в Фаренгейтах?");
var celsius = (farenheit - 32)*5/9;
alert(celsius);

## Number: divide

Сделайте калькулятор для расчета деления нацело двух чисел. Используйте `Math.floor` или альтернативы.

С помощью `prompt` узнайте число, введенное пользователем.
С помощью `if` проверьте что число корректно преобразовано из строки. В случае ошибки выведите сообщение
Выведите четное число или нет, используя `if`.

var a = +prompt("Ведите первое число");
var b = +prompt("Ведите второе число");
alert(Math.floor(a/b));

## Number: odd
var number = prompt("Введите число:");
number = parseFloat(number, 10);
if(isNaN(number)){
  alert("не число")
}
else if(number % 2 ==0){
  alert("четное число")
}
else{
  alert("нечетное число")
}

## String: greeting

Спросите у пользователя имя, и поприветствуйте его с помощью `alert`.

var name = prompt("Как тебя зовут?");
alert(`Привет ${name}!`)

## String: lexics

Спросите у пользователя текст, и проверьте его на наличие некорректного слова или нескольких некорректных слов. Используйте **метод** `indexOf` (или `includes`) строки:

var word = prompt("Что бы вы хотели сказать?");
var badWord = word.includes("Бранная речь");
if(badWord === true){
  alert("Не ругайся")
}

```javascript
"123".indexOf("23") //возвращает 1 - позицию подстроки "23" в "123"
"abcdef".indexOf("ef") // 4
"12345".indexOf("some bad word") // -1 - не найдено
```

[Подробнее](http://lmgtfy.com/?q=javascript+string+indexOf)

## confirm
confirm  возвращает тип boolean со значением true или false

var a = confirm("Вам есть 18?");
if(a === true){
  alert("Заходи")
}
else{
  alert("Выходи")
}

Поэкспериментируйте с `confirm`, определите тип данных, который он возвращает, и конкретные значения этого типа данных.

## Boolean

Напишите код, который спрашивает те или иные вопросы с ответом "да"/"нет" с помощью `confirm`, и сохраняет ответы в переменных. 

var a = confirm("Вам есть 18?");
var b;
var firstVar;
var secondVar;
if(a === true){
  b = firstVar
}
else{
  b = secondVar
}


## Boolean: if

Расширьте предыдущее задание условиями по полученным переменным условиями (`if else`). Например, если вы спрашиваете пол пользователя с помощью `confirm`, то по условию сделайте `alert("Вы женщина")` и `alert("Вы мужчина")`

var a = confirm("Вам есть 18?");
var b;
var firstVar = "Вам есть 18";
var secondVar = "Вам нету 18";
if(a === true){
  b = firstVar
  alert(b)
}
else{
  b = secondVar
  alert(b)
}

## Array: real

Понаходите в вашей жизни вещи, которые похожи на массивы, и другие вещи, которые можно смоделировать с помощью массивов.

Оценки в журнале. Строй солдат.

## Array: booleans

Создайте массив с переменными из заданий `Boolean` и `Boolean if`.

var a = confirm("Вам есть 18?");
var b;
var firstVar = "Вам есть 18";
var secondVar = "Вам нету 18";
if(a === true){
  b = firstVar
  alert(b)
}
else{
  b = secondVar
  alert(b)
}
var c = [a, b, firstVar, secondVar];

## Array: plus

Напишите код, который складывает первые два элемента массива и заносит это в элемент с индексом `2`. Исследуйте полученный массив.

var c = [1, 2, 3, 4, 5];
var sum = c[0] + c[1];
c[2] = sum;

## Array: plus string

Что будет, если в предыдущий примере использовать строки вместо чисел? Сделайте версию для сложения 3х значений. Подумайте, зачем нужна эта возможность в наших примерах.

var c = ["1", "2", "3", "4", "5"];
var sum = c[0] + c[1] + c[2];
alert(sum);

## Object: real

Найдите те или иные реальные объекты и найдите их свойства. Например у маркера это цвет, толщина, уровень `зарядки` (количество краски), у автомобиля - бренд, модель, мощность двигателя, цвет и так далее. Создайте объекты с помощью 
`{}`. В качестве образца посмотрите объект персоны из материала предыдущего занятия

debugger;
var table = {
  height: 75,
  width: 50,
  lenght: 100,
  price: 500 
}

## Object: change

Поменяйте значения свойств в ваших объектах, используя `[]` и `.` и присвоения.

table["height"] = 50;
table.lenght = 80;

## Comparison if

Разберите пример 

```javascript
var age = +prompt("Сколько вам лет?","");
if (age < 18){
    alert("школьник");
}else{
  if (age < 30){
    alert("молодеж");
  }else{ 
    if (age < 45){
      alert("зрелость");
    }else{ 
      if (age < 60){
        alert("закат");
      }else{ 
        if (age >= 60){
          alert("как пенсия?");
        }else {
            alert("то ли киборг, то ли ошибка"); 
        }
      } 
    }
  }
}
```
Добавьте условие отрицательного возраста в пример выше.  Расставьте недостающие (но *синтаксически* необязательные) фигурные скобки. Выкиньте лишнее из текущего кода

## Comparison: sizes

Сделайте перевод  перевод из нашей системы размеров в американскую или любую на выбор. Используйте
`prompt`, условия сравнения и `alert`.

var type1 = confirm("Вы бы хотели перевести размер верхней одежды?");
if(type1 === true){
  var sizeRUSclothes = prompt("Введите размер");
  if(sizeRUSclothes >= 40 && sizeRUSclothes <= 54){
    var sizeUSAclothes = sizeRUSclothes - 32;
    alert(`Ваш размер: ${sizeUSAclothes} `);
  }else{
    alert("Слишком маленький либо слишком большой размер");
  }
}else{
  var type2 = confirm("Женского белья?")  
  if(type2 === true){
    var sizeRUSunderwear = prompt("Введите размер");
    if(sizeRUSunderwear >= 42 && sizeRUSunderwear <= 56){
      var sizeUSAunderwear = sizeRUSunderwear - 34;
      alert(`Ваш размер: ${sizeUSAunderwear} `);
    }else{
      alert("Слишком маленький либо слишком большой размер");
    }
  }else{
    type3 = confirm("Может носков и чулков?")
    if(type3 === true){
      var sizeRUSsocks = prompt("Введите размер");
      if(sizeRUSsocks >= 21 && sizeRUSsocks <= 27){
        var sizeUSAsocks = (sizeRUSsocks - 5)/2 ;
        alert(`Ваш размер: ${sizeUSAsocks} `);
      }else{
        alert("Слишком маленький либо слишком большой размер");
      }
    }else{
      alert("Пока")
    }  
}
}


## Ternary

Спросите у пользователя пол (`confirm`). Выведите с помощью `alert` "Вы мужчина" или "Вы женщина". Сделайте это оператором `alert`. Используйте тернарный оператор.

confirm("Вы мужчина?") ? alert("Вы мужчина") : alert("Вы женщина");

## Синий пояс Number: flats

Сделайте калькулятор, который позволит вам исходя из информации о количества этажей в доме и количества квартир на этаже находить подъезд и этаж определенной квартиры по её номеру.  Например для 9этажного дома по 4 квартиры
на этаж 81 квартира находится на 3м этаже третьего подъезда.

